jdefrancesco/MSP430X-Lens/msp430f5438_binja.h
/*
 * ================================================================
 *  GENERATED MSP430 HEADER FOR BINARY NINJA
 *
 *  Do not edit manually.
 * ================================================================
 */

#ifndef __MSP430_BINJA_AMALGAMATION_H__
#define __MSP430_BINJA_AMALGAMATION_H__

/*
 * ----------------------------------------------------------------
 * Binary Ninja / Clang compatibility layer
 * ----------------------------------------------------------------
 */

#ifndef __MSP430__
#define __MSP430__ 1
#endif

#ifndef __MSP430X__
#define __MSP430X__ 1
#endif

#ifndef __GNUC__
#define __GNUC__ 1
#endif

/* TI/MSP430 compiler extensions we don't need during analysis. */
#ifndef __interrupt
#define __interrupt
#endif

#ifndef __intrinsic
#define __intrinsic
#endif

#ifndef __monitor
#define __monitor
#endif

#ifndef __root
#define __root
#endif

#ifndef __no_init
#define __no_init
#endif

#ifndef __near
#define __near
#endif

#ifndef __far
#define __far
#endif

#ifndef __data16
#define __data16
#endif

#ifndef __data20
#define __data20
#endif

#ifndef __code
#define __code
#endif

#ifndef __eeprom
#define __eeprom
#endif

#ifndef __asm
#define __asm(...)
#endif

/*
 * MSP430 intrinsic calls occasionally appear in headers.
 * They have no meaning to Binja's type parser.
 */
#ifndef __bis_SR_register
#define __bis_SR_register(x)
#endif

#ifndef __bic_SR_register
#define __bic_SR_register(x)
#endif

#ifndef __bis_SR_register_on_exit
#define __bis_SR_register_on_exit(x)
#endif

#ifndef __bic_SR_register_on_exit
#define __bic_SR_register_on_exit(x)
#endif

#ifndef __enable_interrupt
#define __enable_interrupt()
#endif

#ifndef __disable_interrupt
#define __disable_interrupt()
#endif

#ifndef __no_operation
#define __no_operation()
#endif


#ifndef __MSP430F5438__
#define __MSP430F5438__ 1
#endif


/* ============================================================ */
/* BEGIN: msp430-gcc-support-files/include/MSP430F5438.h */
/* ============================================================ */

/* ============================================================================ */
/* Copyright (c) 2020, Texas Instruments Incorporated                           */
/*  All rights reserved.                                                        */
/*                                                                              */
/*  Redistribution and use in source and binary forms, with or without          */
/*  modification, are permitted provided that the following conditions          */
/*  are met:                                                                    */
/*                                                                              */
/*  *  Redistributions of source code must retain the above copyright           */
/*     notice, this list of conditions and the following disclaimer.            */
/*                                                                              */
/*  *  Redistributions in binary form must reproduce the above copyright        */
/*     notice, this list of conditions and the following disclaimer in the      */
/*     documentation and/or other materials provided with the distribution.     */
/*                                                                              */
/*  *  Neither the name of Texas Instruments Incorporated nor the names of      */
/*     its contributors may be used to endorse or promote products derived      */
/*     from this software without specific prior written permission.            */
/*                                                                              */
/*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" */
/*  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,       */
/*  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR      */
/*  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR            */
/*  CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,       */
/*  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,         */
/*  PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; */
/*  OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,    */
/*  WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR     */
/*  OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,              */
/*  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                          */
/* ============================================================================ */

/********************************************************************
*
* Standard register and bit definitions for the Texas Instruments
* MSP430 microcontroller.
*
* This file supports assembler and C development for
* MSP430x54x devices.
*
* Texas Instruments, Version 1.12
*
* Rev. 0.0, Setup
* Rev. 0.1, updated PMM (now contains already new definitions with swapped IFG flags for SVSHIFG/SVSLIFG
* Rev. 0.2, updated USCI/I2C Flags (UCBxIFG not used correctly)
* Rev. 0.3, changed RTCEVIFG to RTCTEVIFG / changed RTIV to RTCIV
* Rev. 0.4, added definitions for Interrupt Vectors xxIV
* Rev. 0.5, changed 'void __data20 * volatile' definition
* Rev. 1.0, fixed wrong bit definitions in FLLCTL7
* Rev. 1.1, fixed wrong definitions for some PxDS addresses
* Rev. 1.2, fixed wrong base address for RTC
* Rev. 1.3, fixed SYSRSTIV Definitions
* Rev. 1.4, removed some unused Definitions for PMM
* Rev. 1.5, changed Definitions for TimerB to TimerB0
*           added USCI word and RTxPS Definitions
* Rev. 1.6, changed ADC12PDIF0 to ADC12PDIV
*           added PMMLPM5IFG
* Rev. 1.7, removed definitions for FLL unlock feature
* Rev. 1.8, added TLV definitions
* Rev. 1.9, added some more DMA Trigger definitions
* Rev. 1.10, clean up of Flash section
* Rev. 1.11, Changed access type of DMAxSZ registers to word only
* Rev. 1.12  Changed access type of TimerA/B registers to word only
*
********************************************************************/

