jdefrancesco/MSP430X-Lens/msp430f5438_binja.h
#define _data20_read_char(addr) \
({ \
        char __dst; \
        unsigned int __tmp; \
	unsigned long __addr = addr; \
	__asm__ __volatile__ ( \
	"movx.a %2, %1 \n\t" \
	"mov.b 0(%1), %0" \
	: "=r"((char) __dst), "=&r"((unsigned int) __tmp) \
	: "m"((unsigned long) __addr) \
	); \
	__dst ; \
})

#define __data20_read_char(addr) _data20_read_char(addr)

#define _data20_write_short(addr,src) \
({ \
        unsigned int __tmp; \
	unsigned long __addr = addr; \
        __asm__ __volatile__ ( \
	"movx.a %1, %0 \n\t" \
	"mov.w  %2, 0(%0)" \
	: "=&r"((unsigned int) __tmp) \
        : "m"((unsigned long) __addr), "ri"((short) src) \
	); \
})

#define __data20_write_short(addr,src) _data20_write_short(addr,src)

#define _data20_read_short(addr) \
({ \
        short __dst; \
        unsigned int __tmp; \
	unsigned long __addr = addr; \
	__asm__ __volatile__ ( \
	"movx.a %2, %1 \n\t" \
	"mov.w 0(%1), %0" \
	: "=r"((short) __dst), "=&r"((unsigned int) __tmp) \
	: "m"((unsigned long) __addr) \
	); \
	__dst ; \
})

#define __data20_read_short(addr) _data20_read_short(addr)

#define _data20_write_long(addr,src) \
({ \
        unsigned int __tmp; \
	unsigned long __addr = addr; \
        __asm__ __volatile__ ( \
	"movx.a %1, %0 \n\t" \
	"mov.w  %L2, 0(%0) \n\t" \
	"mov.w  %H2, 2(%0)" \
	: "=&r"((unsigned int) __tmp) \
        : "m"((unsigned long) __addr), "ri"((long) src) \
	); \
})

#define __data20_write_long(addr,src) _data20_write_long(addr,src)

#define _data20_read_long(addr) \
({ \
        long __dst; \
        unsigned int __tmp; \
	unsigned long __addr = addr; \
	__asm__ __volatile__ ( \
	"movx.a %2, %1 \n\t" \
	"mov.w  0(%1), %L0 \n\t" \
	"mov.w  2(%1), %H0" \
	: "=r"((long) __dst), "=&r"((unsigned int) __tmp) \
	: "m"((unsigned long) __addr) \
	); \
	__dst ; \
})

#define __data20_read_long(addr) _data20_read_long(addr)

#define _low_power_mode_0() _bis_SR_register(0x18)
#define _low_power_mode_1() _bis_SR_register(0x58)
#define _low_power_mode_2() _bis_SR_register(0x98)
#define _low_power_mode_3() _bis_SR_register(0xD8)
#define _low_power_mode_4() _bis_SR_register(0xF8)
#define _low_power_mode_off_on_exit() _bic_SR_register_on_exit(0xF0)

#define __low_power_mode_0() _low_power_mode_0()
#define __low_power_mode_1() _low_power_mode_1()
#define __low_power_mode_2() _low_power_mode_2()
#define __low_power_mode_3() _low_power_mode_3()
#define __low_power_mode_4() _low_power_mode_4()
#define __low_power_mode_off_on_exit() _low_power_mode_off_on_exit()

#define _even_in_range(x,y) (x)
#define __even_in_range(x,y) _even_in_range(x,y)

/* Define some alternative names for the intrinsics, which have been used
   in the various versions of IAR and GCC */
#define __no_operation()                    _no_operation()

#define __get_interrupt_state()             _get_interrupt_state()
#define __set_interrupt_state(x)            _set_interrupt_state(x)
#define __enable_interrupt()                _enable_interrupts()
#define __disable_interrupt()               _disable_interrupts()

#define __bic_SR_register(x)                _bic_SR_register(x)
#define __bis_SR_register(x)                _bis_SR_register(x)
#define __get_SR_register()                 _get_SR_register()

#define __swap_bytes(x)                     _swap_bytes(x)

#define __nop()                             _no_operation()

#define __eint()                            _enable_interrupts()
#define __dint()                            _disable_interrupts()

#define _NOP()                              _no_operation()
#define _EINT()                             _enable_interrupts()
#define _DINT()                             _disable_interrupts()

#define _BIC_SR(x)                          _bic_SR_register(x)
#define _BIC_SR_IRQ(x)                      _bic_SR_register_on_exit(x)
#define _BIS_SR(x)                          _bis_SR_register(x)
#define _BIS_SR_IRQ(x)                      _bis_SR_register_on_exit(x)
#define _BIS_NMI_IE1(x)                     _bis_nmi_ie1(x)

#define _SWAP_BYTES(x)                      _swap_bytes(x)

#define __no_init    __attribute__((noinit))

#endif /* !defined _GNU_ASSEMBLER_ */

#endif /* __IN430_H__ */

/* ============================================================ */
/* END: /Users/jdefr89/projects/amal/msp430-support/src/msp430-gcc-support-files/include/in430.h */
/* ============================================================ */


#define LPM0      __bis_SR_register(LPM0_bits)         /* Enter Low Power Mode 0 */
#define LPM0_EXIT __bic_SR_register_on_exit(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      __bis_SR_register(LPM1_bits)         /* Enter Low Power Mode 1 */
#define LPM1_EXIT __bic_SR_register_on_exit(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      __bis_SR_register(LPM2_bits)         /* Enter Low Power Mode 2 */
#define LPM2_EXIT __bic_SR_register_on_exit(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      __bis_SR_register(LPM3_bits)         /* Enter Low Power Mode 3 */
#define LPM3_EXIT __bic_SR_register_on_exit(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      __bis_SR_register(LPM4_bits)         /* Enter Low Power Mode 4 */
#define LPM4_EXIT __bic_SR_register_on_exit(LPM4_bits) /* Exit Low Power Mode 4 */
#endif /* End #defines for C */

/************************************************************
* PERIPHERAL FILE MAP
************************************************************/

/************************************************************
* ADC12 PLUS
************************************************************/
#define __MSP430_HAS_ADC12_PLUS__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_ADC12_PLUS__ 0x0700
#define ADC12_A_BASE           __MSP430_BASEADDRESS_ADC12_PLUS__

sfr_w(ADC12CTL0);                             /* ADC12+ Control 0 */
sfr_b(ADC12CTL0_L);                           /* ADC12+ Control 0 */
sfr_b(ADC12CTL0_H);                           /* ADC12+ Control 0 */
sfr_w(ADC12CTL1);                             /* ADC12+ Control 1 */
sfr_b(ADC12CTL1_L);                           /* ADC12+ Control 1 */
sfr_b(ADC12CTL1_H);                           /* ADC12+ Control 1 */
sfr_w(ADC12CTL2);                             /* ADC12+ Control 2 */
sfr_b(ADC12CTL2_L);                           /* ADC12+ Control 2 */
sfr_b(ADC12CTL2_H);                           /* ADC12+ Control 2 */
sfr_w(ADC12IFG);                              /* ADC12+ Interrupt Flag */
sfr_b(ADC12IFG_L);                            /* ADC12+ Interrupt Flag */
sfr_b(ADC12IFG_H);                            /* ADC12+ Interrupt Flag */
sfr_w(ADC12IE);                               /* ADC12+ Interrupt Enable */
sfr_b(ADC12IE_L);                             /* ADC12+ Interrupt Enable */
sfr_b(ADC12IE_H);                             /* ADC12+ Interrupt Enable */
sfr_w(ADC12IV);                               /* ADC12+ Interrupt Vector Word */
sfr_b(ADC12IV_L);                             /* ADC12+ Interrupt Vector Word */
sfr_b(ADC12IV_H);                             /* ADC12+ Interrupt Vector Word */

sfr_w(ADC12MEM0);                             /* ADC12 Conversion Memory 0 */
sfr_b(ADC12MEM0_L);                           /* ADC12 Conversion Memory 0 */
sfr_b(ADC12MEM0_H);                           /* ADC12 Conversion Memory 0 */
sfr_w(ADC12MEM1);                             /* ADC12 Conversion Memory 1 */
sfr_b(ADC12MEM1_L);                           /* ADC12 Conversion Memory 1 */
sfr_b(ADC12MEM1_H);                           /* ADC12 Conversion Memory 1 */
sfr_w(ADC12MEM2);                             /* ADC12 Conversion Memory 2 */
sfr_b(ADC12MEM2_L);                           /* ADC12 Conversion Memory 2 */
sfr_b(ADC12MEM2_H);                           /* ADC12 Conversion Memory 2 */
sfr_w(ADC12MEM3);                             /* ADC12 Conversion Memory 3 */
sfr_b(ADC12MEM3_L);                           /* ADC12 Conversion Memory 3 */
sfr_b(ADC12MEM3_H);                           /* ADC12 Conversion Memory 3 */
sfr_w(ADC12MEM4);                             /* ADC12 Conversion Memory 4 */
sfr_b(ADC12MEM4_L);                           /* ADC12 Conversion Memory 4 */
sfr_b(ADC12MEM4_H);                           /* ADC12 Conversion Memory 4 */
sfr_w(ADC12MEM5);                             /* ADC12 Conversion Memory 5 */
sfr_b(ADC12MEM5_L);                           /* ADC12 Conversion Memory 5 */
sfr_b(ADC12MEM5_H);                           /* ADC12 Conversion Memory 5 */
sfr_w(ADC12MEM6);                             /* ADC12 Conversion Memory 6 */
sfr_b(ADC12MEM6_L);                           /* ADC12 Conversion Memory 6 */
sfr_b(ADC12MEM6_H);                           /* ADC12 Conversion Memory 6 */
sfr_w(ADC12MEM7);                             /* ADC12 Conversion Memory 7 */
sfr_b(ADC12MEM7_L);                           /* ADC12 Conversion Memory 7 */
sfr_b(ADC12MEM7_H);                           /* ADC12 Conversion Memory 7 */
sfr_w(ADC12MEM8);                             /* ADC12 Conversion Memory 8 */
sfr_b(ADC12MEM8_L);                           /* ADC12 Conversion Memory 8 */
sfr_b(ADC12MEM8_H);                           /* ADC12 Conversion Memory 8 */
sfr_w(ADC12MEM9);                             /* ADC12 Conversion Memory 9 */
sfr_b(ADC12MEM9_L);                           /* ADC12 Conversion Memory 9 */
sfr_b(ADC12MEM9_H);                           /* ADC12 Conversion Memory 9 */
sfr_w(ADC12MEM10);                            /* ADC12 Conversion Memory 10 */
sfr_b(ADC12MEM10_L);                          /* ADC12 Conversion Memory 10 */
sfr_b(ADC12MEM10_H);                          /* ADC12 Conversion Memory 10 */
sfr_w(ADC12MEM11);                            /* ADC12 Conversion Memory 11 */
sfr_b(ADC12MEM11_L);                          /* ADC12 Conversion Memory 11 */
sfr_b(ADC12MEM11_H);                          /* ADC12 Conversion Memory 11 */
sfr_w(ADC12MEM12);                            /* ADC12 Conversion Memory 12 */
sfr_b(ADC12MEM12_L);                          /* ADC12 Conversion Memory 12 */
sfr_b(ADC12MEM12_H);                          /* ADC12 Conversion Memory 12 */
sfr_w(ADC12MEM13);                            /* ADC12 Conversion Memory 13 */
sfr_b(ADC12MEM13_L);                          /* ADC12 Conversion Memory 13 */
sfr_b(ADC12MEM13_H);                          /* ADC12 Conversion Memory 13 */
sfr_w(ADC12MEM14);                            /* ADC12 Conversion Memory 14 */
sfr_b(ADC12MEM14_L);                          /* ADC12 Conversion Memory 14 */
sfr_b(ADC12MEM14_H);                          /* ADC12 Conversion Memory 14 */
sfr_w(ADC12MEM15);                            /* ADC12 Conversion Memory 15 */
sfr_b(ADC12MEM15_L);                          /* ADC12 Conversion Memory 15 */
sfr_b(ADC12MEM15_H);                          /* ADC12 Conversion Memory 15 */
#define ADC12MEM_              ADC12MEM       /* ADC12 Conversion Memory */
#ifndef __STDC__
#define ADC12MEM               ADC12MEM0      /* ADC12 Conversion Memory (for assembler) */
#else
#define ADC12MEM               ((volatile int*)        &ADC12MEM0) /* ADC12 Conversion Memory (for C) */
#endif

